<?php

return [
    [
        'fio' => "Администратор Админ Админович",
        'job_id' => 1,
        'employ_date' => "2024-05-01",
    ],
    [
        'fio' => "Регистрирующий Иван Иванович",
        'job_id' => 1,
        'employ_date' => "2024-05-01",
        'phone' => "+7 (911) 123-45-67",
    ],
    [
        'fio' => "Регистрация Петр Сменщик",
        'job_id' => 1,
        'employ_date' => "2024-05-02",
    ],
    [
        'fio' => "Главбухг Людмила Уволенная",
        'job_id' => 1,
        'employ_date' => "2024-03-01",
        'leave_date' => "2024-05-10",
    ],
    [
        'fio' => "Пользователь без учетки",
        'job_id' => 1,
        'employ_date' => "2024-05-02",
    ],
];
